In [186]:
import pandas as pd

In [187]:
data = {'이름':['메로나','비비빅','죠스바'],
        '가격':[300,400,250],
        '재고':[20,3,100]}

In [188]:
df = pd.DataFrame(data)

In [189]:
df

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [190]:
df.가격

0    300
1    400
2    250
Name: 가격, dtype: int64

In [191]:
df[['이름','재고']]

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

In [192]:
df.iloc[1][['가격','재고']]

가격    400
재고      3
Name: 1, dtype: object

In [193]:
df.iloc[::2][['가격','재고']]

    가격   재고
0  300   20
2  250  100

In [194]:
df.index = ['일','이','삼']

In [195]:
df.shape

(3, 3)

In [196]:
df['총가격'] = [0,0,0]

In [197]:
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [198]:
df.loc[3] = ['빵빠레',550,10,0]

In [199]:
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
3  빵빠레  550   10    0

In [218]:
df.iloc[1,3] = 23

In [219]:
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3   23
삼  죠스바  250  100    0
3  빵빠레  550   10    0

In [202]:
data = [ [ 2000, 3050, 2050, 1980],
  [ 7500, 2050, 2050, 1980], 
  [15450, 15050, 15550, 14900]
]

In [203]:
DF = pd.DataFrame(data,columns=['시가(open)',
                                '고가(high)',
                                '저가(low)',
                                '종가(close)'])

In [204]:
DF

   시가(open)  고가(high)  저가(low)  종가(close)
0      2000      3050     2050       1980
1      7500      2050     2050       1980
2     15450     15050    15550      14900

In [217]:
print(DF.index)
print(DF.columns)
print(DF.shape)
print(DF.ndim)
print(DF.values)
print(DF.dtypes)

Index(['2024-01-01', '2024-02-01', '2024-03-01', 'Total'], dtype='object')
Index(['Open', 'High', 'Low', 'Close', 'Average'], dtype='object')
(4, 5)
2
[[ 2000  3050  2050  1980     0]
 [ 7500  2050  2050  1980     0]
 [15450 15050 14000 14900     0]
 [    0     0     0     0     0]]
Open       int64
High       int64
Low        int64
Close      int64
Average    int64
dtype: object

In [206]:
DF.index = ['2024-01-01','2024-02-01','2024-03-01']

In [207]:
DF

            시가(open)  고가(high)  저가(low)  종가(close)
2024-01-01      2000      3050     2050       1980
2024-02-01      7500      2050     2050       1980
2024-03-01     15450     15050    15550      14900

In [208]:
DF.columns = ['Open','High','Low','Close']

In [209]:
DF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [210]:
DF.iloc[1][['High','Close']]

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

In [211]:
DF.drop('2024-01-01')

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [212]:
DF.loc['2024-03-01','Low'] = 14000

In [213]:
DF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  14000  14900

In [214]:
DF['Average'] = (0,0,0)
DF

             Open   High    Low  Close  Average
2024-01-01   2000   3050   2050   1980        0
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0

In [215]:
DF.loc['Total'] = [0,0,0,0,0]

In [216]:
DF

             Open   High    Low  Close  Average
2024-01-01   2000   3050   2050   1980        0
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
Total           0      0      0      0        0

- 판다스는 데이터를 분석하기 위한 패키지입니다
- 판다스는 다양한 종류의 데이터를 데이터 프레임 형태로 저장
- 판다스에서 1차원 데이터 자료 저장 구조 시리즈
- 판다스에서 2차원 데이터 자료 저장 구조 데이터 프레임
- 판다스는 내부적으로 데이터를 어레이 형태로 저장
- 판다스는 1개 열/칼럼 추출시 데이터[칼럼명]
- 판다스는 1개 행/로우 추출시 자료구조 데이터.loc/iloc
- 두개 이상은 데이터loc/iloc[행][열]